<template>
  <div ref="raodom-table"></div>
</template>

<script>
export default {
  name: 'Random',
  components: {},
  props: {},
  data () {
    return {
      userList: [
        ['      ', '杨荣锋', '范丽娜', '      ', '   ', '李康超', '于春永', '冯丽莹', '王俊杰'],
        ['梁帅克', '彭长欢', '王锦秀', '罗佳兴', '   ', '马庆波', '吴成云', '万鹏辉', '王瑞刚'],
        ['张继旺', '张国泰', '程立威', '李江林', '   ', '赖建明', '刘甲恒', '张浩斌', '康开赟'],
        ['余  鑫', '姚建强', '黄治钧', '张阳胜', '   ', '赵  超', '芮乐乐', '邵纪丹', '李  鹏'],
        ['雷金辉', '卓根德', '王伟超', '林  杰', '   ', '雷  旺', '刘  灿', '肖震昆', '章  腾'],
        ['韩  娇', '刘  奔', '何凤军', '杨吉祥', '   ', '沈国家', '兰  靖', '张  威', '曾耀荣'],
        ['陈达孚', '李  根', '李  桐', '钟鑫城', '   ', '廖旭承', '王丽军', '程  磊', '李长蒙'],
        ['周  锋', '杨静静', '张  丽', '陈赫凡', '   ', '刘  青', '黄家晖', '吴  洋', '罗星成'],
        ['卢  雨', '叶天阳', '刘佳灏', '柯伟达', '   ', '      ', '      ', '      ', '      '],
        ['卢海潮', '郑鹏辉', '      ', '陈广辉', '   ', '      ', '      ', '      ', '      ']
      ],
      groupLeader: ['范丽娜', '张国泰', '王伟超', '李  桐', '叶天阳', '冯丽莹', '张浩斌', '肖震昆', '程  磊'],
    }
  },
  watch: {},
  computed: {},
  mounted () { },
  methods: {
    initTable () {
      let html = this.userList.reduce((h, i, x) => { }, '')
    },
  },
}
</script>

<style lang='less' scoped>
</style>