export const indicator = [
  { name: '语文', max: 150 },
  { name: '数学', max: 150 },
  { name: '英语', max: 150 },
  { name: '生物', max: 100 },
  { name: '物理', max: 100 },
  { name: '化学', max: 100 },
]

export const gradeTable = [
  {
    name: '一次月考',
    value: [109, 130, 127, 87, 95, 78],
  },
  {
    name: '二次月考',
    value: [98, 123, 136, 96, 92, 82],
  },
  {
    name: '三次月考',
    value: [99, 133, 135, 94, 86, 85],
  },
  {
    name: '四次月考',
    value: [108, 128, 138, 82, 92, 86],
  },
  {
    name: '五次月考',
    value: [100, 147, 129, 102, 92, 67],
  },
  {
    name: '六次月考',
    value: [96, 126, 137, 108, 85, 87],
  },
  {
    name: '七次月考',
    value: [101, 118, 136, 102, 94, 88],
  },
  {
    name: '八次月考',
    value: [110, 135, 138, 90, 85, 82],
  },
  {
    name: '九次月考',
    value: [110, 128, 141, 101, 96, 82],
  },
]
